---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.TemporaryModeFailureWireframe
enum: Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
source: html/c87dc425-1e13-40b9-df6d-08fde112210b.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.TemporaryModeFailureWireframe

Temporary mode cannot be set for the view because wireframe display style is set for the view.